app/views/profiles/index.html.erb

    <% if @profile && @profile.skills%>
    <% @profile.skills.each do |skill| %>
---
SELECT "skills".* FROM "skills" WHERE "skills"."profile_id" = ?  [["profile_id", 1]]